---
kind: type
id: T:Autodesk.Revit.DB.Architecture.CutMarkType
source: html/6f2d8dc7-6a19-fba3-00ae-a88cfe0e3d34.htm
---
# Autodesk.Revit.DB.Architecture.CutMarkType

An object represents the cut mark type in Autodesk Revit.

## Syntax (C#)
```csharp
public class CutMarkType : ElementType
```